app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "synopsis", "cover_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "book"], ["author", "author"], ["synopsis", "synopsis"], ["cover_image", "image.jpeg"], ["created_at", "2020-09-24 16:23:15.089277"], ["updated_at", "2020-09-24 16:23:15.089277"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "title" = $1, "author" = $2, "synopsis" = $3, "cover_image" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "book"], ["author", "author"], ["synopsis", "summary"], ["cover_image", "image.jpeg"], ["updated_at", "2020-09-24 16:24:54.608765"], ["id", 1]]
---
  def update
    if @book.update(book_params)